Revit 2027 API
BoundingBoxIntersectsFilter Methods
The BoundingBoxIntersectsFilter type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundingBox |  Gets the outline being used for this filter.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
BoundingBoxIntersectsFilter Class
Autodesk.Revit.DB Namespace